In [49]:
import pandas as pd

In [50]:
import random

In [3]:
!pip install pandas

Collecting pandas
  Downloading pandas-2.0.3-cp38-cp38-win32.whl (9.6 MB)
Collecting tzdata>=2022.1
  Downloading tzdata-2023.3-py2.py3-none-any.whl (341 kB)
Requirement already satisfied: numpy>=1.20.3 in c:\users\amelia azmi\source\miniconda\envs\basicpython\lib\site-packages (from pandas) (1.24.4)
Collecting pytz>=2020.1
  Downloading pytz-2023.3-py2.py3-none-any.whl (502 kB)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\amelia azmi\source\miniconda\envs\basicpython\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: six>=1.5 in c:\users\amelia azmi\source\miniconda\envs\basicpython\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Installing collected packages: tzdata, pytz, pandas
Successfully installed pandas-2.0.3 pytz-2023.3 tzdata-2023.3

In [18]:
import os

In [21]:
import openpyxl

In [20]:
!pip install openpyxl

Collecting openpyxl
  Downloading openpyxl-3.1.2-py2.py3-none-any.whl (249 kB)
Collecting et-xmlfile
  Downloading et_xmlfile-1.1.0-py3-none-any.whl (4.7 kB)
Installing collected packages: et-xmlfile, openpyxl
Successfully installed et-xmlfile-1.1.0 openpyxl-3.1.2

In [1]:
import numpy

Collecting numpy
  Downloading numpy-1.24.4-cp38-cp38-win32.whl (12.5 MB)
Installing collected packages: numpy
Successfully installed numpy-1.24.4

In [2]:
!pip install numpy

Requirement already satisfied: numpy in c:\users\amelia azmi\source\miniconda\envs\basicpython\lib\site-packages (1.24.4)

## 1. Load data data_for_pandas_exercise.xlsx menjadi DataFrame.

In [22]:
downloads_dir = os.path.expanduser("~")
downloads_file_path = os.path.join(downloads_dir, 'Downloads', 'data_for_pandas_exercise.xlsx')
df = pd.read_excel(downloads_file_path)

In [23]:
df

        Nama  Umur            Kota
0      Alice  25.0        New York
1        Bob  30.0     Los Angeles
2    Charlie  22.0         Chicago
3      David  27.0         Houston
4       Emma  29.0           Miami
5      Frank   NaN         Seattle
6      Grace  20.0          Boston
7      Henry  45.0          Dallas
8   Isabella  31.0   San Francisco
9       Jack  28.0          Austin
10      Kate  24.0          Denver
11      Liam  35.0         Phoenix
12       Mia  26.0    Philadelphia
13      Noah  32.0       San Diego
14    Olivia  36.0      Washington
15     Peter  21.0         Atlanta
16     Quinn  23.0        Portland
17    Rachel  38.0       Baltimore
18    Samuel  19.0       Las Vegas
19    Taylor  34.0       Nashville
20    Ursula  37.0     Minneapolis
21    Victor  40.0     New Orleans
22     Wendy  39.0         Orlando
23    Xavier  42.0  Salt Lake City
24      Yara  43.0           Tampa
25   Zachary  44.0     Albuquerque
26       Ava  18.0         Detroit
27  Benjamin   NaN       Charlotte
28     Chloe  27.0    Indianapolis
29    Daniel  25.0        Columbus
30     Emily  22.0    Jacksonville
31     Fiona  31.0     Kansas City
32    George  30.0       Milwaukee
33    Hannah  24.0   Oklahoma City
34     Isaac   NaN         Memphis
35     Julia  26.0      Louisville
36     Kevin  21.0           Omaha
37      Lily  33.0         Raleigh
38   Matthew  35.0       Cleveland
39      Nora  37.0      Pittsburgh
40     Oscar  39.0      Cincinnati
41  Penelope  41.0         Buffalo
42    Quincy  20.0        Hartford
43   Rebecca  42.0        Richmond
44   Stephen  36.0          Austin
45      Tara  32.0     San Antonio
46   Ulysses  34.0        San Jose
47    Violet  38.0      Sacramento
48   William  23.0       Anchorage
49    Xander  19.0        Honolulu

## 2.Tampilkan 3 baris terakhir dari DataFrame.

In [24]:
last_three_rows = df.tail(3)
print(last_three_rows)

       Nama  Umur        Kota
47   Violet  38.0  Sacramento
48  William  23.0   Anchorage
49   Xander  19.0    Honolulu

## 3. Isi nilai yang hilang/missing values dalam kolom Umur dengan median umur.

In [27]:
median_umur = df['Umur'].median()

In [28]:
df['Umur'].fillna(median_umur, inplace=True)

In [29]:
print(df)

        Nama  Umur            Kota
0      Alice  25.0        New York
1        Bob  30.0     Los Angeles
2    Charlie  22.0         Chicago
3      David  27.0         Houston
4       Emma  29.0           Miami
5      Frank  31.0         Seattle
6      Grace  20.0          Boston
7      Henry  45.0          Dallas
8   Isabella  31.0   San Francisco
9       Jack  28.0          Austin
10      Kate  24.0          Denver
11      Liam  35.0         Phoenix
12       Mia  26.0    Philadelphia
13      Noah  32.0       San Diego
14    Olivia  36.0      Washington
15     Peter  21.0         Atlanta
16     Quinn  23.0        Portland
17    Rachel  38.0       Baltimore
18    Samuel  19.0       Las Vegas
19    Taylor  34.0       Nashville
20    Ursula  37.0     Minneapolis
21    Victor  40.0     New Orleans
22     Wendy  39.0         Orlando
23    Xavier  42.0  Salt Lake City
24      Yara  43.0           Tampa
25   Zachary  44.0     Albuquerque
26       Ava  18.0         Detroit
27  Benjamin  31.0       Charlotte
28     Chloe  27.0    Indianapolis
29    Daniel  25.0        Columbus
30     Emily  22.0    Jacksonville
31     Fiona  31.0     Kansas City
32    George  30.0       Milwaukee
33    Hannah  24.0   Oklahoma City
34     Isaac  31.0         Memphis
35     Julia  26.0      Louisville
36     Kevin  21.0           Omaha
37      Lily  33.0         Raleigh
38   Matthew  35.0       Cleveland
39      Nora  37.0      Pittsburgh
40     Oscar  39.0      Cincinnati
41  Penelope  41.0         Buffalo
42    Quincy  20.0        Hartford
43   Rebecca  42.0        Richmond
44   Stephen  36.0          Austin
45      Tara  32.0     San Antonio
46   Ulysses  34.0        San Jose
47    Violet  38.0      Sacramento
48   William  23.0       Anchorage
49    Xander  19.0        Honolulu

## 4. Tampilkan statistik ringkasan untuk kolom Umur

In [35]:
umur_summary = df['Umur'].describe()
print(umur_summary)

count    50.000000
mean     30.720000
std       7.543182
min      18.000000
25%      24.250000
50%      31.000000
75%      36.750000
max      45.000000
Name: Umur, dtype: float64

## 5. Pilih dan tampilkan hanya baris-baris di mana Umur kurang dari 30

In [36]:
filtered_rows = df[df['Umur'] < 30]
print(filtered_rows)

       Nama  Umur           Kota
0     Alice  25.0       New York
2   Charlie  22.0        Chicago
3     David  27.0        Houston
4      Emma  29.0          Miami
6     Grace  20.0         Boston
9      Jack  28.0         Austin
10     Kate  24.0         Denver
12      Mia  26.0   Philadelphia
15    Peter  21.0        Atlanta
16    Quinn  23.0       Portland
18   Samuel  19.0      Las Vegas
26      Ava  18.0        Detroit
28    Chloe  27.0   Indianapolis
29   Daniel  25.0       Columbus
30    Emily  22.0   Jacksonville
33   Hannah  24.0  Oklahoma City
35    Julia  26.0     Louisville
36    Kevin  21.0          Omaha
42   Quincy  20.0       Hartford
48  William  23.0      Anchorage
49   Xander  19.0       Honolulu

## 6. Pilih dan tampilkan hanya baris-baris di mana Nama berwalan huruf P atau Q dan Umur dari 20 - 30 tahun

In [38]:
filtered_rows = df[(df['Nama'].str.startswith('P') | 
                    df['Nama'].str.startswith('Q')) & 
                   (df['Umur'] >= 20) & (df['Umur'] <= 30)]
print(filtered_rows)

      Nama  Umur      Kota
15   Peter  21.0   Atlanta
16   Quinn  23.0  Portland
42  Quincy  20.0  Hartford

## 7. Hitung jumlah kemunculan masing-masing nilai unik dalam kolom Kota

In [39]:
kota_counts = df['Kota'].value_counts()
print(kota_counts)

Kota
Austin            2
New York          1
Raleigh           1
Charlotte         1
Indianapolis      1
Columbus          1
Jacksonville      1
Kansas City       1
Milwaukee         1
Oklahoma City     1
Memphis           1
Louisville        1
Omaha             1
Cleveland         1
Albuquerque       1
Pittsburgh        1
Cincinnati        1
Buffalo           1
Hartford          1
Richmond          1
San Antonio       1
San Jose          1
Sacramento        1
Anchorage         1
Detroit           1
Tampa             1
Los Angeles       1
Philadelphia      1
Chicago           1
Houston           1
Miami             1
Seattle           1
Boston            1
Dallas            1
San Francisco     1
Denver            1
Phoenix           1
San Diego         1
Salt Lake City    1
Washington        1
Atlanta           1
Portland          1
Baltimore         1
Las Vegas         1
Nashville         1
Minneapolis       1
New Orleans       1
Orlando           1
Honolulu          1
Name: count, dtype: int64

## 8. Tambahkan kolom baru bernama Jenis Kelamin dengan nilai acak "Laki-laki" dan "Perempuan"

In [51]:
def generate_jenis_kelamin():
    return random.choice(["Laki-laki", "Perempuan"])
df['Jenis Kelamin'] = df.apply(lambda row: generate_jenis_kelamin(), axis=1)
print(df)

        Nama  Umur            Kota Jenis Kelamin
0      Alice  25.0        New York     Laki-laki
1        Bob  30.0     Los Angeles     Perempuan
2    Charlie  22.0         Chicago     Laki-laki
3      David  27.0         Houston     Perempuan
4       Emma  29.0           Miami     Laki-laki
5      Frank  31.0         Seattle     Perempuan
6      Grace  20.0          Boston     Laki-laki
7      Henry  45.0          Dallas     Perempuan
8   Isabella  31.0   San Francisco     Perempuan
9       Jack  28.0          Austin     Laki-laki
10      Kate  24.0          Denver     Perempuan
11      Liam  35.0         Phoenix     Perempuan
12       Mia  26.0    Philadelphia     Perempuan
13      Noah  32.0       San Diego     Perempuan
14    Olivia  36.0      Washington     Laki-laki
15     Peter  21.0         Atlanta     Laki-laki
16     Quinn  23.0        Portland     Perempuan
17    Rachel  38.0       Baltimore     Perempuan
18    Samuel  19.0       Las Vegas     Laki-laki
19    Taylor  34.0       Nashville     Laki-laki
20    Ursula  37.0     Minneapolis     Perempuan
21    Victor  40.0     New Orleans     Laki-laki
22     Wendy  39.0         Orlando     Perempuan
23    Xavier  42.0  Salt Lake City     Laki-laki
24      Yara  43.0           Tampa     Perempuan
25   Zachary  44.0     Albuquerque     Laki-laki
26       Ava  18.0         Detroit     Laki-laki
27  Benjamin  31.0       Charlotte     Laki-laki
28     Chloe  27.0    Indianapolis     Laki-laki
29    Daniel  25.0        Columbus     Perempuan
30     Emily  22.0    Jacksonville     Perempuan
31     Fiona  31.0     Kansas City     Perempuan
32    George  30.0       Milwaukee     Laki-laki
33    Hannah  24.0   Oklahoma City     Laki-laki
34     Isaac  31.0         Memphis     Laki-laki
35     Julia  26.0      Louisville     Perempuan
36     Kevin  21.0           Omaha     Laki-laki
37      Lily  33.0         Raleigh     Laki-laki
38   Matthew  35.0       Cleveland     Laki-laki
39      Nora  37.0      Pittsburgh     Laki-laki
40     Oscar  39.0      Cincinnati     Laki-laki
41  Penelope  41.0         Buffalo     Perempuan
42    Quincy  20.0        Hartford     Perempuan
43   Rebecca  42.0        Richmond     Laki-laki
44   Stephen  36.0          Austin     Laki-laki
45      Tara  32.0     San Antonio     Laki-laki
46   Ulysses  34.0        San Jose     Laki-laki
47    Violet  38.0      Sacramento     Laki-laki
48   William  23.0       Anchorage     Laki-laki
49    Xander  19.0        Honolulu     Laki-laki

## 9. Ganti nama kolom Kota menjadi Lokasi

In [54]:
df.rename(columns={'Kota': 'Lokasi'}, inplace=True)
print(df)

        Nama  Umur          Lokasi Jenis Kelamin
0      Alice  25.0        New York     Laki-laki
1        Bob  30.0     Los Angeles     Perempuan
2    Charlie  22.0         Chicago     Laki-laki
3      David  27.0         Houston     Perempuan
4       Emma  29.0           Miami     Laki-laki
5      Frank  31.0         Seattle     Perempuan
6      Grace  20.0          Boston     Laki-laki
7      Henry  45.0          Dallas     Perempuan
8   Isabella  31.0   San Francisco     Perempuan
9       Jack  28.0          Austin     Laki-laki
10      Kate  24.0          Denver     Perempuan
11      Liam  35.0         Phoenix     Perempuan
12       Mia  26.0    Philadelphia     Perempuan
13      Noah  32.0       San Diego     Perempuan
14    Olivia  36.0      Washington     Laki-laki
15     Peter  21.0         Atlanta     Laki-laki
16     Quinn  23.0        Portland     Perempuan
17    Rachel  38.0       Baltimore     Perempuan
18    Samuel  19.0       Las Vegas     Laki-laki
19    Taylor  34.0       Nashville     Laki-laki
20    Ursula  37.0     Minneapolis     Perempuan
21    Victor  40.0     New Orleans     Laki-laki
22     Wendy  39.0         Orlando     Perempuan
23    Xavier  42.0  Salt Lake City     Laki-laki
24      Yara  43.0           Tampa     Perempuan
25   Zachary  44.0     Albuquerque     Laki-laki
26       Ava  18.0         Detroit     Laki-laki
27  Benjamin  31.0       Charlotte     Laki-laki
28     Chloe  27.0    Indianapolis     Laki-laki
29    Daniel  25.0        Columbus     Perempuan
30     Emily  22.0    Jacksonville     Perempuan
31     Fiona  31.0     Kansas City     Perempuan
32    George  30.0       Milwaukee     Laki-laki
33    Hannah  24.0   Oklahoma City     Laki-laki
34     Isaac  31.0         Memphis     Laki-laki
35     Julia  26.0      Louisville     Perempuan
36     Kevin  21.0           Omaha     Laki-laki
37      Lily  33.0         Raleigh     Laki-laki
38   Matthew  35.0       Cleveland     Laki-laki
39      Nora  37.0      Pittsburgh     Laki-laki
40     Oscar  39.0      Cincinnati     Laki-laki
41  Penelope  41.0         Buffalo     Perempuan
42    Quincy  20.0        Hartford     Perempuan
43   Rebecca  42.0        Richmond     Laki-laki
44   Stephen  36.0          Austin     Laki-laki
45      Tara  32.0     San Antonio     Laki-laki
46   Ulysses  34.0        San Jose     Laki-laki
47    Violet  38.0      Sacramento     Laki-laki
48   William  23.0       Anchorage     Laki-laki
49    Xander  19.0        Honolulu     Laki-laki

## 10. Urutkan DataFrame berdasarkan Umur secara menaik

In [57]:
df.sorted = df.sort_values(by='Umur', ascending=True)
print(df.sorted)

        Nama  Umur          Lokasi Jenis Kelamin
26       Ava  18.0         Detroit     Laki-laki
49    Xander  19.0        Honolulu     Laki-laki
18    Samuel  19.0       Las Vegas     Laki-laki
42    Quincy  20.0        Hartford     Perempuan
6      Grace  20.0          Boston     Laki-laki
36     Kevin  21.0           Omaha     Laki-laki
15     Peter  21.0         Atlanta     Laki-laki
2    Charlie  22.0         Chicago     Laki-laki
30     Emily  22.0    Jacksonville     Perempuan
48   William  23.0       Anchorage     Laki-laki
16     Quinn  23.0        Portland     Perempuan
33    Hannah  24.0   Oklahoma City     Laki-laki
10      Kate  24.0          Denver     Perempuan
29    Daniel  25.0        Columbus     Perempuan
0      Alice  25.0        New York     Laki-laki
12       Mia  26.0    Philadelphia     Perempuan
35     Julia  26.0      Louisville     Perempuan
3      David  27.0         Houston     Perempuan
28     Chloe  27.0    Indianapolis     Laki-laki
9       Jack  28.0          Austin     Laki-laki
4       Emma  29.0           Miami     Laki-laki
32    George  30.0       Milwaukee     Laki-laki
1        Bob  30.0     Los Angeles     Perempuan
34     Isaac  31.0         Memphis     Laki-laki
31     Fiona  31.0     Kansas City     Perempuan
5      Frank  31.0         Seattle     Perempuan
8   Isabella  31.0   San Francisco     Perempuan
27  Benjamin  31.0       Charlotte     Laki-laki
45      Tara  32.0     San Antonio     Laki-laki
13      Noah  32.0       San Diego     Perempuan
37      Lily  33.0         Raleigh     Laki-laki
46   Ulysses  34.0        San Jose     Laki-laki
19    Taylor  34.0       Nashville     Laki-laki
11      Liam  35.0         Phoenix     Perempuan
38   Matthew  35.0       Cleveland     Laki-laki
14    Olivia  36.0      Washington     Laki-laki
44   Stephen  36.0          Austin     Laki-laki
20    Ursula  37.0     Minneapolis     Perempuan
39      Nora  37.0      Pittsburgh     Laki-laki
17    Rachel  38.0       Baltimore     Perempuan
47    Violet  38.0      Sacramento     Laki-laki
22     Wendy  39.0         Orlando     Perempuan
40     Oscar  39.0      Cincinnati     Laki-laki
21    Victor  40.0     New Orleans     Laki-laki
41  Penelope  41.0         Buffalo     Perempuan
23    Xavier  42.0  Salt Lake City     Laki-laki
43   Rebecca  42.0        Richmond     Laki-laki
24      Yara  43.0           Tampa     Perempuan
25   Zachary  44.0     Albuquerque     Laki-laki
7      Henry  45.0          Dallas     Perempuan

## 11. Ganti semua nilai "New York" dalam kolom Lokasi dengan "NYC"

In [61]:
df['Lokasi'] = df['Lokasi'].replace('New York', 'NYC')
print(df)

        Nama  Umur          Lokasi Jenis Kelamin
0      Alice  25.0             NYC     Laki-laki
1        Bob  30.0     Los Angeles     Perempuan
2    Charlie  22.0         Chicago     Laki-laki
3      David  27.0         Houston     Perempuan
4       Emma  29.0           Miami     Laki-laki
5      Frank  31.0         Seattle     Perempuan
6      Grace  20.0          Boston     Laki-laki
7      Henry  45.0          Dallas     Perempuan
8   Isabella  31.0   San Francisco     Perempuan
9       Jack  28.0          Austin     Laki-laki
10      Kate  24.0          Denver     Perempuan
11      Liam  35.0         Phoenix     Perempuan
12       Mia  26.0    Philadelphia     Perempuan
13      Noah  32.0       San Diego     Perempuan
14    Olivia  36.0      Washington     Laki-laki
15     Peter  21.0         Atlanta     Laki-laki
16     Quinn  23.0        Portland     Perempuan
17    Rachel  38.0       Baltimore     Perempuan
18    Samuel  19.0       Las Vegas     Laki-laki
19    Taylor  34.0       Nashville     Laki-laki
20    Ursula  37.0     Minneapolis     Perempuan
21    Victor  40.0     New Orleans     Laki-laki
22     Wendy  39.0         Orlando     Perempuan
23    Xavier  42.0  Salt Lake City     Laki-laki
24      Yara  43.0           Tampa     Perempuan
25   Zachary  44.0     Albuquerque     Laki-laki
26       Ava  18.0         Detroit     Laki-laki
27  Benjamin  31.0       Charlotte     Laki-laki
28     Chloe  27.0    Indianapolis     Laki-laki
29    Daniel  25.0        Columbus     Perempuan
30     Emily  22.0    Jacksonville     Perempuan
31     Fiona  31.0     Kansas City     Perempuan
32    George  30.0       Milwaukee     Laki-laki
33    Hannah  24.0   Oklahoma City     Laki-laki
34     Isaac  31.0         Memphis     Laki-laki
35     Julia  26.0      Louisville     Perempuan
36     Kevin  21.0           Omaha     Laki-laki
37      Lily  33.0         Raleigh     Laki-laki
38   Matthew  35.0       Cleveland     Laki-laki
39      Nora  37.0      Pittsburgh     Laki-laki
40     Oscar  39.0      Cincinnati     Laki-laki
41  Penelope  41.0         Buffalo     Perempuan
42    Quincy  20.0        Hartford     Perempuan
43   Rebecca  42.0        Richmond     Laki-laki
44   Stephen  36.0          Austin     Laki-laki
45      Tara  32.0     San Antonio     Laki-laki
46   Ulysses  34.0        San Jose     Laki-laki
47    Violet  38.0      Sacramento     Laki-laki
48   William  23.0       Anchorage     Laki-laki
49    Xander  19.0        Honolulu     Laki-laki

## 12. Kelompokkan DataFrame berdasarkan Lokasi dan hitung median Umur di setiap kelompok. (hint: pelajari groupby dan agg/aggreate)

In [62]:
grouped_data = df.groupby('Lokasi')['Umur'].agg(median_umur='median')
print(grouped_data)

                median_umur
Lokasi
Albuquerque            44.0
Anchorage              23.0
Atlanta                21.0
Austin                 32.0
Baltimore              38.0
Boston                 20.0
Buffalo                41.0
Charlotte              31.0
Chicago                22.0
Cincinnati             39.0
Cleveland              35.0
Columbus               25.0
Dallas                 45.0
Denver                 24.0
Detroit                18.0
Hartford               20.0
Honolulu               19.0
Houston                27.0
Indianapolis           27.0
Jacksonville           22.0
Kansas City            31.0
Las Vegas              19.0
Los Angeles            30.0
Louisville             26.0
Memphis                31.0
Miami                  29.0
Milwaukee              30.0
Minneapolis            37.0
NYC                    25.0
Nashville              34.0
New Orleans            40.0
Oklahoma City          24.0
Omaha                  21.0
Orlando                39.0
Philadelphia           26.0
Phoenix                35.0
Pittsburgh             37.0
Portland               23.0
Raleigh                33.0
Richmond               42.0
Sacramento             38.0
Salt Lake City         42.0
San Antonio            32.0
San Diego              32.0
San Francisco          31.0
San Jose               34.0
Seattle                31.0
Tampa                  43.0
Washington             36.0

## 13. Buat DataFrame baru hanya dengan baris-baris di mana Umur ganjil

In [64]:
df_odd_umur = df[df['Umur'] % 2 != 0]
print(df_odd_umur)

        Nama  Umur         Lokasi Jenis Kelamin
0      Alice  25.0            NYC     Laki-laki
3      David  27.0        Houston     Perempuan
4       Emma  29.0          Miami     Laki-laki
5      Frank  31.0        Seattle     Perempuan
7      Henry  45.0         Dallas     Perempuan
8   Isabella  31.0  San Francisco     Perempuan
11      Liam  35.0        Phoenix     Perempuan
15     Peter  21.0        Atlanta     Laki-laki
16     Quinn  23.0       Portland     Perempuan
18    Samuel  19.0      Las Vegas     Laki-laki
20    Ursula  37.0    Minneapolis     Perempuan
22     Wendy  39.0        Orlando     Perempuan
24      Yara  43.0          Tampa     Perempuan
27  Benjamin  31.0      Charlotte     Laki-laki
28     Chloe  27.0   Indianapolis     Laki-laki
29    Daniel  25.0       Columbus     Perempuan
31     Fiona  31.0    Kansas City     Perempuan
34     Isaac  31.0        Memphis     Laki-laki
36     Kevin  21.0          Omaha     Laki-laki
37      Lily  33.0        Raleigh     Laki-laki
38   Matthew  35.0      Cleveland     Laki-laki
39      Nora  37.0     Pittsburgh     Laki-laki
40     Oscar  39.0     Cincinnati     Laki-laki
41  Penelope  41.0        Buffalo     Perempuan
48   William  23.0      Anchorage     Laki-laki
49    Xander  19.0       Honolulu     Laki-laki

## 14. Simpan DataFrame yang sudah dimodifikasi menjadi file CSV baru

In [65]:
output_csv_path = os.path.join(os.path.expanduser("~"), 'Downloads', 'modified_data.csv')
df.to_csv(output_csv_path, index=False)

## 15. Terapkan fungsi yang mengonversi nama-nama dalam kolom Nama menjadi huruf kecil

In [67]:
df['Nama'] = df['Nama'].str.lower()
print(df)

        Nama  Umur          Lokasi Jenis Kelamin
0      alice  25.0             NYC     Laki-laki
1        bob  30.0     Los Angeles     Perempuan
2    charlie  22.0         Chicago     Laki-laki
3      david  27.0         Houston     Perempuan
4       emma  29.0           Miami     Laki-laki
5      frank  31.0         Seattle     Perempuan
6      grace  20.0          Boston     Laki-laki
7      henry  45.0          Dallas     Perempuan
8   isabella  31.0   San Francisco     Perempuan
9       jack  28.0          Austin     Laki-laki
10      kate  24.0          Denver     Perempuan
11      liam  35.0         Phoenix     Perempuan
12       mia  26.0    Philadelphia     Perempuan
13      noah  32.0       San Diego     Perempuan
14    olivia  36.0      Washington     Laki-laki
15     peter  21.0         Atlanta     Laki-laki
16     quinn  23.0        Portland     Perempuan
17    rachel  38.0       Baltimore     Perempuan
18    samuel  19.0       Las Vegas     Laki-laki
19    taylor  34.0       Nashville     Laki-laki
20    ursula  37.0     Minneapolis     Perempuan
21    victor  40.0     New Orleans     Laki-laki
22     wendy  39.0         Orlando     Perempuan
23    xavier  42.0  Salt Lake City     Laki-laki
24      yara  43.0           Tampa     Perempuan
25   zachary  44.0     Albuquerque     Laki-laki
26       ava  18.0         Detroit     Laki-laki
27  benjamin  31.0       Charlotte     Laki-laki
28     chloe  27.0    Indianapolis     Laki-laki
29    daniel  25.0        Columbus     Perempuan
30     emily  22.0    Jacksonville     Perempuan
31     fiona  31.0     Kansas City     Perempuan
32    george  30.0       Milwaukee     Laki-laki
33    hannah  24.0   Oklahoma City     Laki-laki
34     isaac  31.0         Memphis     Laki-laki
35     julia  26.0      Louisville     Perempuan
36     kevin  21.0           Omaha     Laki-laki
37      lily  33.0         Raleigh     Laki-laki
38   matthew  35.0       Cleveland     Laki-laki
39      nora  37.0      Pittsburgh     Laki-laki
40     oscar  39.0      Cincinnati     Laki-laki
41  penelope  41.0         Buffalo     Perempuan
42    quincy  20.0        Hartford     Perempuan
43   rebecca  42.0        Richmond     Laki-laki
44   stephen  36.0          Austin     Laki-laki
45      tara  32.0     San Antonio     Laki-laki
46   ulysses  34.0        San Jose     Laki-laki
47    violet  38.0      Sacramento     Laki-laki
48   william  23.0       Anchorage     Laki-laki
49    xander  19.0        Honolulu     Laki-laki

## 16. Hitung persentil ke-25 dari kolom Umur

In [68]:
quartile_25 = df['Umur'].quantile(0.25)
print(quartile_25)

24.25

## 17. Hitung dan tampilkan rata-rata umur untuk setiap kombinasi unik Lokasi dan Jenis Kelamin. (hint: pelajari groupby dan agg/aggreate)

In [91]:
grouped_data = df.groupby(['Lokasi', 'Jenis Kelamin'])['Umur'].agg(mean_umur='mean')
print(grouped_data)

                              mean_umur
Lokasi         Jenis Kelamin
Albuquerque    Laki-laki           44.0
Anchorage      Laki-laki           23.0
Atlanta        Laki-laki           21.0
Austin         Laki-laki           32.0
Baltimore      Perempuan           38.0
Boston         Laki-laki           20.0
Buffalo        Perempuan           41.0
CHI            Laki-laki           22.0
Charlotte      Laki-laki           31.0
Cincinnati     Laki-laki           39.0
Cleveland      Laki-laki           35.0
Columbus       Perempuan           25.0
Dallas         Perempuan           45.0
Denver         Perempuan           24.0
Detroit        Laki-laki           18.0
Hartford       Perempuan           20.0
Honolulu       Laki-laki           19.0
Houston        Perempuan           27.0
Indianapolis   Laki-laki           27.0
Jacksonville   Perempuan           22.0
Kansas City    Perempuan           31.0
Las Vegas      Laki-laki           19.0
Los Angeles    Perempuan           30.0
Louisville     Perempuan           26.0
Memphis        Laki-laki           31.0
Miami          Laki-laki           29.0
Milwaukee      Laki-laki           30.0
Minneapolis    Perempuan           37.0
NYC            Laki-laki           25.0
Nashville      Laki-laki           34.0
New Orleans    Laki-laki           40.0
Oklahoma City  Laki-laki           24.0
Omaha          Laki-laki           21.0
Orlando        Perempuan           39.0
Philadelphia   Perempuan           26.0
Phoenix        Perempuan           35.0
Pittsburgh     Laki-laki           37.0
Portland       Perempuan           23.0
Raleigh        Laki-laki           33.0
Richmond       Laki-laki           42.0
Sacramento     Laki-laki           38.0
Salt Lake City Laki-laki           42.0
San Antonio    Laki-laki           32.0
San Diego      Perempuan           32.0
San Francisco  Perempuan           31.0
San Jose       Laki-laki           34.0
Seattle        Perempuan           31.0
Tampa          Perempuan           43.0
Washington     Laki-laki           36.0

## 18. Hapus baris-baris duplikat berdasarkan kolom Lokasi

In [70]:
df_unique = df.drop_duplicates(subset=['Lokasi'])
print(df_unique)

        Nama  Umur          Lokasi Jenis Kelamin
0      alice  25.0             NYC     Laki-laki
1        bob  30.0     Los Angeles     Perempuan
2    charlie  22.0         Chicago     Laki-laki
3      david  27.0         Houston     Perempuan
4       emma  29.0           Miami     Laki-laki
5      frank  31.0         Seattle     Perempuan
6      grace  20.0          Boston     Laki-laki
7      henry  45.0          Dallas     Perempuan
8   isabella  31.0   San Francisco     Perempuan
9       jack  28.0          Austin     Laki-laki
10      kate  24.0          Denver     Perempuan
11      liam  35.0         Phoenix     Perempuan
12       mia  26.0    Philadelphia     Perempuan
13      noah  32.0       San Diego     Perempuan
14    olivia  36.0      Washington     Laki-laki
15     peter  21.0         Atlanta     Laki-laki
16     quinn  23.0        Portland     Perempuan
17    rachel  38.0       Baltimore     Perempuan
18    samuel  19.0       Las Vegas     Laki-laki
19    taylor  34.0       Nashville     Laki-laki
20    ursula  37.0     Minneapolis     Perempuan
21    victor  40.0     New Orleans     Laki-laki
22     wendy  39.0         Orlando     Perempuan
23    xavier  42.0  Salt Lake City     Laki-laki
24      yara  43.0           Tampa     Perempuan
25   zachary  44.0     Albuquerque     Laki-laki
26       ava  18.0         Detroit     Laki-laki
27  benjamin  31.0       Charlotte     Laki-laki
28     chloe  27.0    Indianapolis     Laki-laki
29    daniel  25.0        Columbus     Perempuan
30     emily  22.0    Jacksonville     Perempuan
31     fiona  31.0     Kansas City     Perempuan
32    george  30.0       Milwaukee     Laki-laki
33    hannah  24.0   Oklahoma City     Laki-laki
34     isaac  31.0         Memphis     Laki-laki
35     julia  26.0      Louisville     Perempuan
36     kevin  21.0           Omaha     Laki-laki
37      lily  33.0         Raleigh     Laki-laki
38   matthew  35.0       Cleveland     Laki-laki
39      nora  37.0      Pittsburgh     Laki-laki
40     oscar  39.0      Cincinnati     Laki-laki
41  penelope  41.0         Buffalo     Perempuan
42    quincy  20.0        Hartford     Perempuan
43   rebecca  42.0        Richmond     Laki-laki
45      tara  32.0     San Antonio     Laki-laki
46   ulysses  34.0        San Jose     Laki-laki
47    violet  38.0      Sacramento     Laki-laki
48   william  23.0       Anchorage     Laki-laki
49    xander  19.0        Honolulu     Laki-laki

## 19. Gunakan fungsi apply untuk mengubah semua nilai Umur menjadi string

In [92]:
df['Umur'] = df['Umur'].apply(str)
print(df)

        Nama  Umur          Lokasi Jenis Kelamin
0      alice  25.0             NYC     Laki-laki
1        bob  30.0     Los Angeles     Perempuan
2    charlie  22.0             CHI     Laki-laki
3      david  27.0         Houston     Perempuan
4       emma  29.0           Miami     Laki-laki
5      frank  31.0         Seattle     Perempuan
6      grace  20.0          Boston     Laki-laki
7      henry  45.0          Dallas     Perempuan
8   isabella  31.0   San Francisco     Perempuan
9       jack  28.0          Austin     Laki-laki
10      kate  24.0          Denver     Perempuan
11      liam  35.0         Phoenix     Perempuan
12       mia  26.0    Philadelphia     Perempuan
13      noah  32.0       San Diego     Perempuan
14    olivia  36.0      Washington     Laki-laki
15     peter  21.0         Atlanta     Laki-laki
16     quinn  23.0        Portland     Perempuan
17    rachel  38.0       Baltimore     Perempuan
18    samuel  19.0       Las Vegas     Laki-laki
19    taylor  34.0       Nashville     Laki-laki
20    ursula  37.0     Minneapolis     Perempuan
21    victor  40.0     New Orleans     Laki-laki
22     wendy  39.0         Orlando     Perempuan
23    xavier  42.0  Salt Lake City     Laki-laki
24      yara  43.0           Tampa     Perempuan
25   zachary  44.0     Albuquerque     Laki-laki
26       ava  18.0         Detroit     Laki-laki
27  benjamin  31.0       Charlotte     Laki-laki
28     chloe  27.0    Indianapolis     Laki-laki
29    daniel  25.0        Columbus     Perempuan
30     emily  22.0    Jacksonville     Perempuan
31     fiona  31.0     Kansas City     Perempuan
32    george  30.0       Milwaukee     Laki-laki
33    hannah  24.0   Oklahoma City     Laki-laki
34     isaac  31.0         Memphis     Laki-laki
35     julia  26.0      Louisville     Perempuan
36     kevin  21.0           Omaha     Laki-laki
37      lily  33.0         Raleigh     Laki-laki
38   matthew  35.0       Cleveland     Laki-laki
39      nora  37.0      Pittsburgh     Laki-laki
40     oscar  39.0      Cincinnati     Laki-laki
41  penelope  41.0         Buffalo     Perempuan
42    quincy  20.0        Hartford     Perempuan
43   rebecca  42.0        Richmond     Laki-laki
44   stephen  36.0          Austin     Laki-laki
45      tara  32.0     San Antonio     Laki-laki
46   ulysses  34.0        San Jose     Laki-laki
47    violet  38.0      Sacramento     Laki-laki
48   william  23.0       Anchorage     Laki-laki
49    xander  19.0        Honolulu     Laki-laki

## 20. Hitung dan tampilkan usia maksimum untuk setiap Lokasi

In [73]:
grouped_data = df.groupby('Lokasi')['Umur'].max()
print(grouped_data)

Lokasi
Albuquerque       44.0
Anchorage         23.0
Atlanta           21.0
Austin            36.0
Baltimore         38.0
Boston            20.0
Buffalo           41.0
Charlotte         31.0
Chicago           22.0
Cincinnati        39.0
Cleveland         35.0
Columbus          25.0
Dallas            45.0
Denver            24.0
Detroit           18.0
Hartford          20.0
Honolulu          19.0
Houston           27.0
Indianapolis      27.0
Jacksonville      22.0
Kansas City       31.0
Las Vegas         19.0
Los Angeles       30.0
Louisville        26.0
Memphis           31.0
Miami             29.0
Milwaukee         30.0
Minneapolis       37.0
NYC               25.0
Nashville         34.0
New Orleans       40.0
Oklahoma City     24.0
Omaha             21.0
Orlando           39.0
Philadelphia      26.0
Phoenix           35.0
Pittsburgh        37.0
Portland          23.0
Raleigh           33.0
Richmond          42.0
Sacramento        38.0
Salt Lake City    42.0
San Antonio       32.0
San Diego         32.0
San Francisco     31.0
San Jose          34.0
Seattle           31.0
Tampa             43.0
Washington        36.0
Name: Umur, dtype: object

## 21. Ganti semua kemunculan "Chicago" dalam kolom Lokasi dengan "CHI"

In [74]:
df['Lokasi'] = df['Lokasi'].replace('Chicago', 'CHI')
print(df)

        Nama  Umur          Lokasi Jenis Kelamin
0      alice  25.0             NYC     Laki-laki
1        bob  30.0     Los Angeles     Perempuan
2    charlie  22.0             CHI     Laki-laki
3      david  27.0         Houston     Perempuan
4       emma  29.0           Miami     Laki-laki
5      frank  31.0         Seattle     Perempuan
6      grace  20.0          Boston     Laki-laki
7      henry  45.0          Dallas     Perempuan
8   isabella  31.0   San Francisco     Perempuan
9       jack  28.0          Austin     Laki-laki
10      kate  24.0          Denver     Perempuan
11      liam  35.0         Phoenix     Perempuan
12       mia  26.0    Philadelphia     Perempuan
13      noah  32.0       San Diego     Perempuan
14    olivia  36.0      Washington     Laki-laki
15     peter  21.0         Atlanta     Laki-laki
16     quinn  23.0        Portland     Perempuan
17    rachel  38.0       Baltimore     Perempuan
18    samuel  19.0       Las Vegas     Laki-laki
19    taylor  34.0       Nashville     Laki-laki
20    ursula  37.0     Minneapolis     Perempuan
21    victor  40.0     New Orleans     Laki-laki
22     wendy  39.0         Orlando     Perempuan
23    xavier  42.0  Salt Lake City     Laki-laki
24      yara  43.0           Tampa     Perempuan
25   zachary  44.0     Albuquerque     Laki-laki
26       ava  18.0         Detroit     Laki-laki
27  benjamin  31.0       Charlotte     Laki-laki
28     chloe  27.0    Indianapolis     Laki-laki
29    daniel  25.0        Columbus     Perempuan
30     emily  22.0    Jacksonville     Perempuan
31     fiona  31.0     Kansas City     Perempuan
32    george  30.0       Milwaukee     Laki-laki
33    hannah  24.0   Oklahoma City     Laki-laki
34     isaac  31.0         Memphis     Laki-laki
35     julia  26.0      Louisville     Perempuan
36     kevin  21.0           Omaha     Laki-laki
37      lily  33.0         Raleigh     Laki-laki
38   matthew  35.0       Cleveland     Laki-laki
39      nora  37.0      Pittsburgh     Laki-laki
40     oscar  39.0      Cincinnati     Laki-laki
41  penelope  41.0         Buffalo     Perempuan
42    quincy  20.0        Hartford     Perempuan
43   rebecca  42.0        Richmond     Laki-laki
44   stephen  36.0          Austin     Laki-laki
45      tara  32.0     San Antonio     Laki-laki
46   ulysses  34.0        San Jose     Laki-laki
47    violet  38.0      Sacramento     Laki-laki
48   william  23.0       Anchorage     Laki-laki
49    xander  19.0        Honolulu     Laki-laki

## 22. Hitung persentase masing-masing nilai unik dalam kolom Lokasi.

In [79]:
value_counts = df['Lokasi'].value_counts()
total_data = len(df)
percentage = (value_counts / total_data) * 100
print(percentage)

Lokasi
Austin            4.0
NYC               2.0
Raleigh           2.0
Charlotte         2.0
Indianapolis      2.0
Columbus          2.0
Jacksonville      2.0
Kansas City       2.0
Milwaukee         2.0
Oklahoma City     2.0
Memphis           2.0
Louisville        2.0
Omaha             2.0
Cleveland         2.0
Albuquerque       2.0
Pittsburgh        2.0
Cincinnati        2.0
Buffalo           2.0
Hartford          2.0
Richmond          2.0
San Antonio       2.0
San Jose          2.0
Sacramento        2.0
Anchorage         2.0
Detroit           2.0
Tampa             2.0
Los Angeles       2.0
Philadelphia      2.0
CHI               2.0
Houston           2.0
Miami             2.0
Seattle           2.0
Boston            2.0
Dallas            2.0
San Francisco     2.0
Denver            2.0
Phoenix           2.0
San Diego         2.0
Salt Lake City    2.0
Washington        2.0
Atlanta           2.0
Portland          2.0
Baltimore         2.0
Las Vegas         2.0
Nashville         2.0
Minneapolis       2.0
New Orleans       2.0
Orlando           2.0
Honolulu          2.0
Name: count, dtype: float64